Revit 2024 API
ViewPlanType Enumeration
An enumerated type listing plan view types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum ViewPlanType
Visual Basic
Public Enumeration ViewPlanType
Visual C++
public enum class ViewPlanType
Members
Member name | Description
FloorPlan | Floor plan view.
CeilingPlan | Reflected ceiling plan view.
See Also
Autodesk.Revit.DB Namespace